---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationY
source: html/7b8f6395-c00d-06f9-a96e-7eeecefa780c.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationY Property

Fixity of translation along Y.

## Syntax (C#)
```csharp
public AnalyticalFixityState TranslationY { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The fixity state translationY is not valid for Analytical Link Type parameters.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration